Revit 2026 API

# ReferenceElementId Property

---

The element id for this reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ElementId { get; }
```
```vb
Public ReadOnly Property ElementId As ElementId
	Get
```
```cpp
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```
```fsharp
member ElementId : ElementId with get
```

#### Property Value

ElementId

InvalidElementId will be returned for references that don't refer to a particular element.

#### Reference

Reference Class

Autodesk.Revit.DB Namespace